In [7]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.


import pandas as pd

s= [4, 8, 15, 16, 23, 42]

In [8]:
a=pd.Series(s)

In [9]:
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [11]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on thevariable print it.


a=[1,2,3,4.56,23,'ani',238,567,'ami',5]

b=pd.Series(a)

In [12]:
b

0       1
1       2
2       3
3    4.56
4      23
5     ani
6     238
7     567
8     ami
9       5
dtype: object

In [13]:
#Q3. Create a Pandas DataFrame that contains the following data:

import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27], 'Gender': ['Female', 'Male', 'Female']}
df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


import numpy as np
import pandas as pd

a=np.random.randint(5, size=(4,4))
a

array([[2, 4, 0, 3],
       [0, 0, 1, 2],
       [3, 1, 3, 1],
       [2, 2, 3, 0]])

In [17]:
b=pd.DataFrame(a)

In [18]:
b  """ data frame is tabular data with multiple rows and columns"""

   0  1  2  3
0  2  4  0  3
1  0  0  1  2
2  3  1  3  1
3  2  2  3  0

In [21]:
c=pd.Series(a[0])

In [27]:
  """ series is also a type of data type but it is a column vector[single column]"""

' series is also a type of data type but it is a column vector[single column]'

In [26]:
c

0    2
1    4
2    0
3    3
dtype: int64

In [30]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''


url=pd.read_csv("https://raw.githubusercontent.com/datasets/covid-19/main/data/countries-aggregated.csv")

In [31]:
url

              Date      Country  Confirmed  Recovered  Deaths
0       2020-01-22  Afghanistan          0          0       0
1       2020-01-23  Afghanistan          0          0       0
2       2020-01-24  Afghanistan          0          0       0
3       2020-01-25  Afghanistan          0          0       0
4       2020-01-26  Afghanistan          0          0       0
...            ...          ...        ...        ...     ...
161563  2022-04-12     Zimbabwe     247094          0    5460
161564  2022-04-13     Zimbabwe     247160          0    5460
161565  2022-04-14     Zimbabwe     247208          0    5462
161566  2022-04-15     Zimbabwe     247237          0    5462
161567  2022-04-16     Zimbabwe     247237          0    5462

[161568 rows x 5 columns]

In [33]:
url.head()

         Date      Country  Confirmed  Recovered  Deaths
0  2020-01-22  Afghanistan          0          0       0
1  2020-01-23  Afghanistan          0          0       0
2  2020-01-24  Afghanistan          0          0       0
3  2020-01-25  Afghanistan          0          0       0
4  2020-01-26  Afghanistan          0          0       0

In [34]:
url.tail()

              Date   Country  Confirmed  Recovered  Deaths
161563  2022-04-12  Zimbabwe     247094          0    5460
161564  2022-04-13  Zimbabwe     247160          0    5460
161565  2022-04-14  Zimbabwe     247208          0    5462
161566  2022-04-15  Zimbabwe     247237          0    5462
161567  2022-04-16  Zimbabwe     247237          0    5462

In [35]:
url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161568 entries, 0 to 161567
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       161568 non-null  object
 1   Country    161568 non-null  object
 2   Confirmed  161568 non-null  int64
 3   Recovered  161568 non-null  int64
 4   Deaths     161568 non-null  int64
dtypes: int64(3), object(2)
memory usage: 6.2+ MB

In [38]:
url.dtypes

Date         object
Country      object
Confirmed     int64
Recovered     int64
Deaths        int64
dtype: object

In [ ]:
'''drop(): to remove one or more columns or rows from the DataFrame.
rename(): to rename one or more columns of the DataFrame''

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


#DataFrame,panel bothare Mutable

In [52]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [51]:
import pandas as pd

sub = pd.Series(['maths','science' ,'social'])
marks = pd.Series([35,46,12])
rem = pd.Series(['pass','pass','Fail'])

df = pd.concat([sub,marks,rem], axis=1)
df.columns = ['sub', 'marks', 'rem']

print(df)

       sub  marks   rem
0    maths     35  pass
1  science     46  pass
2   social     12  Fail